Revit 2024 API
TableView.GetCalculatedValueText Method
 Gets the calculated value text for a cell from the instance view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string GetCalculatedValueText(
	SectionType sectionType,
	int row,
	int column
)
Visual Basic
Public Function GetCalculatedValueText ( _
	sectionType As SectionType, _
	row As Integer, _
	column As Integer _
) As String
Visual C++
public:
String^ GetCalculatedValueText(
	SectionType sectionType,
	int row,
	int column
)
Parameters
sectionType
Type: Autodesk.Revit.DB.SectionType
 The section type.
row
Type: System.Int32
 The row.
column
Type: System.Int32
 The column.
Return Value
 The calculated value text.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The sectionType is not a valid type for this view.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given row number row is invalid. -or- The given column number column is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
TableView Class
Autodesk.Revit.DB Namespace